&НаКлиенте
Процедура Загрузить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьДанныеЗавершение", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения, "", , , УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		ПродолжитьЧтение(Адрес);
	КонецЕсли;
	
КонецПроцедуры  

&НаСервереБезКонтекста
Процедура ПродолжитьЧтение(Адрес)
	
	ИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
	ДД = ПолучитьИзВременногоХранилища(Адрес);
	ДД.Записать(ИмяФайла);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	
	ОбластьЯчеек = ТабличныйДокумент.Область(1, 1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы);
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	ТабЗначений = ПостроительОтчета.Результат.Выгрузить();
	
	Для Каждого Стр Из ТабЗначений Цикл
		
		Номенклатура = НайтиНоменклатуруНаСервере(Стр.Оборудование);
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не удалось обнаружить оборудование <" + Стр.Оборудование + ">");
			Продолжить;
		КонецЕсли;
		
		ЗаписатьКодОНИМА(Номенклатура, Стр.КодОНИМА);
		
	КонецЦикла;
	
КонецПроцедуры