Процедура ВыполнитьОбменПоУзлу(Узел, ИмяФайлаПравил) Экспорт
	
	Попытка
		
		Обработка = Обработки.УниверсальныйОбменДаннымиXML.Создать();

	    //Задаём необходимые для выгрузки параметры (необязательные для редактирования)
	    Обработка.РежимОбмена="Выгрузка";
	    Обработка.ЗагружатьДанныеВРежимеОбмена=Истина;
	    Обработка.ЗаписыватьРегистрыНаборамиЗаписей=Истина;
	    Обработка.ЗапоминатьЗагруженныеОбъекты=Истина;
	    Обработка.ИспользоватьОтборПоДатеДляВсехОбъектов=Ложь;
	    Обработка.ВыгружатьТолькоРазрешенные=Истина;
	    // Задали необходимые параметры для выгрузки

	    // Данные параметры необходимо перезаполнить ОБЯЗАТЕЛЬНО

	    // Устанавливаем ограничения на выгрузку по датам объектов
	    Обработка.ДатаНачала = ТекущаяДатаСеанса();
	    Обработка.ДатаОкончания = '00010101';

	    // Если хотим выгружать данные в файл - ставим Ложь, Если Истина - будет произведена выгрузка в базу-приёмник
	    Обработка.НепосредственноеЧтениеВИБПриемнике = Истина;

	    // Если база-приёмник выгружаемых данных является серверной, то Ложь. Если файловая - Истина 
		Обработка.ТипИнформационнойБазыДляПодключения=Ложь;

	    // Обязательные параметры перезаполнили

	    // Если выгружаем данные в файл
		Если Не Обработка.НепосредственноеЧтениеВИБПриемнике Тогда
		    
			Обработка.ИмяФайлаОбмена = ИмяФайлаДанных;
		 
		// Если выгружаем даннные в базу
		Иначе 
		
			ДанныеПодключения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Узел, "ИмяСервера, ИмяБазы, Логин, Пароль");
		
			Обработка.ВерсияПлатформыИнформационнойБазыДляПодключения="V83";
	        Обработка.ПарольИнформационнойБазыДляПодключения 		= ДанныеПодключения.Пароль;
	        Обработка.ПользовательИнформационнойБазыДляПодключения	= ДанныеПодключения.Логин;
	        //Если приёмник данных - серверная база
	        Если Обработка.ТипИнформационнойБазыДляПодключения = Ложь Тогда
	            
				Обработка.ИмяСервераИнформационнойБазыДляПодключения   = ДанныеПодключения.ИмяСервера;
	            Обработка.ИмяИнформационнойБазыНаСервереДляПодключения = ДанныеПодключения.ИмяБазы;

	        // Если приёмник данных - файловая база    
	        Иначе

				Обработка.ВерсияПлатформыИнформационнойБазыДляПодключения="V83";
				Обработка.КаталогИнформационнойБазыДляПодключения = ПараметрыБазы.КаталогИнформационнойБазы;

	        КонецЕсли;
		КонецЕсли;

	    // Действия над регистрацией при выгрузке по планам обмена
	    Обработка.ТипУдаленияРегистрацииИзмененийДляУзловОбменаПослеВыгрузки=2; 
	    // 0 - не снимать регистрацию,
	    // 1 - снимать регистрацию
		
		Обработка.ИмяФайлаПравилОбмена = ИмяФайлаПравил;
	    Обработка.ЗагрузитьПравилаОбмена();

		Обработка.ПараметрыИнициализированы = Истина;
		
	    // ЕСЛИ НУЖНО ВЫГРУЖАТЬ ПО ПЛАНАМ ОБМЕНА, ТО ВКЛЮЧАЕМ ЭТОТ БЛОК И ПОДСТАВЛЯЕМ СВОЙ УЗЕЛ ПЛАНА ОБМЕНА
	    Для Каждого Стр Из Обработка.ТаблицаПравилВыгрузки.Строки Цикл
	        Стр.Включить=1;
	        Для Каждого Стр1 Из Стр.Строки Цикл
	            Стр1.Включить=1;
	            Стр1.СсылкаНаУзелОбмена = Узел;
	        КонецЦикла;
	    КонецЦикла;

	    Обработка.ВыполнитьВыгрузку();
		
		Если Обработка.ФлагОшибки Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось выгрузить данные");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные успешно выгружены");
		КонецЕсли;
		
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("не удалось выгрузить данные"+символы.ПС+ОписаниеОшибки());
		
	КонецПопытки;
		
КонецПроцедуры