// Данный код рассчитан на то, что в объекте есть реквизиты СчетУчетаРасчетов и Субконто1, Субконто2, Субконто3 
// Реквизиты выведены на форму с такими именами элементов

// Реквизиты объекта Субконто1, Субконто2, Субконто3 должны иметь связь по типу с реквизитом СчетучетаРасчетов 
// Номера элементов связи 1, 2, 3 соответственно

&НаКлиенте
Процедура СчетУчетаРасчетовПриИзменении(Элемент)
	
	УстановитьСвойстваСубконто();
	
КонецПроцедуры
	
&НаСервере
Процедура УстановитьСвойстваСубконто()
	
	Поля = Новый Структура("Субконто1, Субконто2, Субконто3, СчетУчета, Подразделение", 
		"Субконто1", "Субконто2", "Субконто3", "СчетУчетаРасчетов", "Подразделение");
	
	ПараметрыУстановки = Новый Структура();
	ПараметрыУстановки.Вставить("ПоляФормы",  	 		Поля);
	ПараметрыУстановки.Вставить("ПоляОбъекта", 			Поля);
	ПараметрыУстановки.Вставить("СкрыватьСубконто", 	Истина);
	ПараметрыУстановки.Вставить("ДопРеквизиты", 		Новый Структура);
	ПараметрыУстановки.Вставить("ЗначенияПоУмолчанию", 	Новый Структура);
	
	БухгалтерскийУчетКлиентСервер.УстановитьСвойстваСубконтоШапкиПриИзмененииСчета(
		ЭтаФорма, Объект, ПараметрыУстановки);
	
КонецПроцедуры
